{
  "ecommerce": {
    "title": "Plataforma E-commerce Enterprise",
    "shortDescription": "Sistema de comercio electrónico escalable con arquitectura de microservicios",
    "profiles": {
      "developer": {
        "description": "Arquitectura de microservicios con .NET Core 8 y Angular 17. Sistema de pagos integrado con Stripe y gestión de inventario en tiempo real.",
        "highlights": [
          "API Gateway con Ocelot + Redis Cache para 50k req/min",
          "SQL Server optimizado con índices clustered y particionamiento",
          "Reducción del 60% en tiempos de respuesta vs. monolito anterior"
        ]
      },
      "analista": {
        "description": "Rediseño arquitectónico completo basado en Domain-Driven Design y Event Storming. Migración de monolito a microservicios.",
        "highlights": [
          "Identificación de 5 Bounded Contexts (Catálogo, Pedidos, Pagos, Inventario, Usuarios)",
          "Modelado UML completo y definición de contratos de API (OpenAPI)",
          "Reducción del 40% en deuda técnica y mejora en mantenibilidad"
        ]
      },
      "ia-engineer": {
        "description": "Sistema de recomendaciones inteligente usando embeddings y búsqueda semántica. Chatbot de atención al cliente con RAG.",
        "highlights": [
          "Integración de OpenAI Embeddings para recomendaciones personalizadas",
          "Pinecone como vector database para búsqueda semántica",
          "Aumento del 35% en tasa de conversión gracias a recomendaciones"
        ]
      }
    }
  },
  "task-manager-ddd": {
    "title": "Task Manager con DDD",
    "shortDescription": "Gestor de tareas empresarial con arquitectura limpia y DDD",
    "profiles": {
      "developer": {
        "description": "Aplicación full-stack con Clean Architecture, CQRS y Event Sourcing. Backend en .NET 8 y frontend en Angular con NgRx.",
        "highlights": [
          "Implementación de CQRS con MediatR y Event Sourcing",
          "Testing automatizado con 85% de cobertura (xUnit + Cypress)",
          "Deploy automatizado en Azure con CI/CD (GitHub Actions)"
        ]
      },
      "analista": {
        "description": "Diseño de dominio complejo con múltiples agregados y políticas de negocio. Modelado de flujos de trabajo con estados y transiciones.",
        "highlights": [
          "Definición de 3 Agregados principales (Task, Project, Team)",
          "Modelado de máquinas de estado para ciclo de vida de tareas",
          "Documentación técnica completa con diagramas UML y C4"
        ]
      }
    }
  },
  "microservicios-api": {
    "title": "API Gateway con Microservicios",
    "shortDescription": "Arquitectura de microservicios con mensajería asíncrona",
    "profiles": {
      "developer": {
        "description": "Sistema distribuido con 8 microservicios independientes. Comunicación asíncrona con RabbitMQ y sincronización con gRPC.",
        "highlights": [
          "API Gateway con autenticación JWT y rate limiting",
          "RabbitMQ para eventos de dominio y comunicación asíncrona",
          "Observabilidad con Prometheus, Grafana y Seq para logs"
        ]
      },
      "analista": {
        "description": "Estrategia de descomposición de monolito en microservicios. Definición de contratos y políticas de comunicación entre servicios.",
        "highlights": [
          "Análisis de dependencias y definición de bounded contexts",
          "Estrategia de migración gradual sin downtime",
          "Documentación de patrones: Saga, API Composition, CQRS"
        ]
      }
    }
  },
  "chatbot-rag": {
    "title": "Chatbot RAG Enterprise",
    "shortDescription": "Sistema de respuesta automática con IA y búsqueda semántica",
    "profiles": {
      "ia-engineer": {
        "description": "Chatbot inteligente que responde preguntas basándose en documentación técnica interna. Usa embeddings y búsqueda vectorial para contexto relevante.",
        "highlights": [
          "LangChain + OpenAI GPT-4 para generación de respuestas",
          "Pinecone como vector database con 10k+ documentos indexados",
          "Reducción del 70% en consultas manuales al equipo de soporte"
        ]
      },
      "developer": {
        "description": "Backend en FastAPI con integración a sistemas legacy .NET. Frontend en React con streaming de respuestas en tiempo real.",
        "highlights": [
          "API REST con FastAPI y autenticación OAuth2",
          "Integración con Active Directory para SSO",
          "WebSockets para streaming de respuestas del LLM"
        ]
      }
    }
  },
  "data-extraction-llm": {
    "title": "Extracción de Datos con LLMs",
    "shortDescription": "Pipeline automatizado para convertir PDFs en datos estructurados",
    "profiles": {
      "ia-engineer": {
        "description": "Sistema que procesa documentos no estructurados (facturas, contratos) y extrae datos validados para sistemas legacy.",
        "highlights": [
          "Python + Pydantic para validación de esquemas",
          "GPT-4o para extracción con function calling",
          "Precisión del 95% en extracción de campos críticos"
        ]
      },
      "developer": {
        "description": "Integración con SQL Server y sistemas .NET existentes. Pipeline de procesamiento batch con Azure Functions.",
        "highlights": [
          "Azure Functions para procesamiento serverless",
          "Integración con SQL Server via Entity Framework",
          "Procesamiento de 1000+ documentos/día"
        ]
      }
    }
  }
}
